In [1]:
import pandas as pd
import gspread
from sqlalchemy import Column, Integer
from sqlalchemy import create_engine
from sqlalchemy.ext.declarative import declarative_base

In [2]:
engine = create_engine('postgresql+psycopg2://admin:7410@localhost/algebra')

In [7]:
df = pd.read_sql_table("customer_data", engine)

In [8]:
df

    customer_id customer_name                       date       gender
0             1        Broddy              Asia/Shanghai         Male
1             2         Willa           America/New_York       Female
2             3         Daren          America/Guatemala         Male
3             4         Ryann             Asia/Chongqing       Female
4             5        Britte               Europe/Paris       Female
5             6        Gannie             America/Bogota         Male
6             7         Theda              Asia/Shanghai       Female
7             8           Lee           Asia/Krasnoyarsk       Female
8             9          Dell             Asia/Chongqing       Female
9            10    Bartolomeo              Asia/Shanghai         Male
10           11           Stu                Asia/Manila         Male
11           12         Denny  America/Argentina/Mendoza       Female
12           13        Tibold                Asia/Manila         Male
13           14      Rosalind               Asia/Kashgar       Female
14           15          Tedd                Asia/Tehran         Male
15           16         Steve              Asia/Shanghai         Male
16           17         Allen            Africa/Ndjamena         Male
17           18           Dev             America/Bogota         Male
18           19          Kele                Asia/Manila         Male
19           20      Leonidas              Asia/Shanghai         Male
20           21        Rozele           Europe/Stockholm       Female
21           22        Amalie              Europe/Warsaw       Female
22           23       Terence             Asia/Chongqing         Male
23           24           Fee             Asia/Chongqing         Male
24           25         Berty                Asia/Riyadh       Female
25           26         Gilda             Asia/Chongqing       Female
26           27        Birgit                Asia/Manila       Female
27           28         Terri               Asia/Jakarta         Male
28           29          Ozzy                Asia/Harbin         Male
29           30       Annabal                Asia/Manila       Female
30           31       Kerstin        Africa/Johannesburg       Female
31           32       Katleen              Asia/Shanghai  Genderqueer
32           33         Aldis             Asia/Chongqing         Male
33           34      Brandise                 Asia/Tokyo       Female
34           35         Drugi                Asia/Tehran         Male
35           36       Bertram     America/Port-au-Prince         Male
36           37       Spenser              Asia/Shanghai         Male
37           38           Lev      America/Santo_Domingo         Male
38           39          Hart              Europe/Dublin         Male
39           40        Gerome              Asia/Makassar  Genderfluid
40           41          Borg              Asia/Shanghai         Male
41           42        Jerald                Asia/Tehran         Male
42           43       Antonia               Asia/Bangkok      Agender
43           44        Rudolf             Africa/Tripoli         Male
44           45          Doug              Europe/Zagreb  Genderfluid
45           46        Myrtle               Asia/Jakarta       Female
46           47       Antonie          Africa/Porto-Novo       Female
47           48        Pattin           America/New_York         Male
48           49           Gar           Europe/Mariehamn         Male
49           50      Panchito               Europe/Minsk         Male

In [10]:
df2 = pd.read_csv("MOCK_DATA.csv")
df2

    customer_id    Customer_name               date  gender
0             1           Verina   Europe/Stockholm  Female
1             2           Camila        Asia/Harbin  Female
2             3           Ruthie  America/Sao_Paulo  Female
3             4            Jocko       Asia/Bangkok    Male
4             5           Lamond      Africa/Bamako    Male
..          ...              ...                ...     ...
95           96  Helen-elizabeth        Asia/Manila  Female
96           97         Charmine       Africa/Cairo  Female
97           98               Hi      Europe/Warsaw    Male
98           99          Millard      Europe/Athens    Male
99          100           Patton      Asia/Shanghai    Male

[100 rows x 4 columns]

In [11]:
df.to_sql("customer_data",
          con=engine, index=False, if_exists='append')

50